package balexej.lesson14;
//1. Ввести с консоли имя файла.
// Найти байт или байты с максимальным количеством повторов.
// Вывести их на экран через пробел. Закрыть поток ввода-вывода.

import java.util.Scanner;

public class Task1 {
    public static void main(String[] args){
        Scanner sc = new Scanner(System.in);
        System.out.println("Введите имя файла");
        String name = sc.nextLine();

    }
}
